data = {'петровский':    0.24615384615384617, 'питания': 0.23846153846153847, 'продукты': 0.23846153846153847,
        'архангельский': 0.015384615384615385, 'траловый': 0.015384615384615385, 'флот': 0.015384615384615385,
        'пятрочка':      0.015384615384615385, 'макси': 0.07692307692307693, 'магнит': 0.09230769230769231,
        'магазин':       0.015384615384615385, 'продуктовый': 0.015384615384615385, 'aprel': 0.007692307692307693,
        'апрель':        0.007692307692307693}

description = "Петровский"
destination = "Петровский: Продукты питания"

src = f"{description} {destination}".lower()

processing_weight = 0.00

for word, weight in data.items():
	if word in src: processing_weight += weight

print("Продукты питания = ", processing_weight)
